{"people": [{"name": "Ryan McGriskin", "year": "U4+", "department": "Mechanical Engineering", "role": "Captain/Technical Director", "blurb": "During my years on this team, I have spent countless hours working, learned countless lessons, and made countless friendships; being a part of McGill Baja Racing is an ever-rewarding experience that I am extremely grateful for. We have a great challenge a"}, {"name": "Benjamin Jordan", "year": "U3", "department": "Mechanical Engineering", "role": "Captain/Drivetrain Subteam Leader", "blurb": "This team provides a vehicle for us students to work on our passions and to build our experiences. It also provides a vehicle to for me to take out my frustrations and run Steph off the road."}, {"name": "Nima Hemati", "year": "U2", "department": "Mechanical Engineering", "role": "Transmission Subteam Leader", "blurb": "Through my involvement with Baja, I strive to help the team attain a spot on the pedestal, as well as facilitate the transfer of knowledge, whether it be learning new skills from more senior members, or by guiding new members. While our team is comprised "}, {"name": "Zach Katz", "year": "U2", "department": "Materials Engineering", "role": "Composites and Engine Subteam Leaders", "blurb": "Something something add lightness! "}, {"name": "Mark Teron", "year": "U2", "department": "Mechanical", "role": "Body Panel Subteam Leader", "blurb": "Between the thrill of driving, the tedious fun of working on the cars and the engineering community found outside the classroom, Baja is the place to be. Sitting in the dungeon watching CNC machines will teach you more than any classroom could, like watch"}, {"name": "Omar Marwan", "year": "U1", "department": "Computer Engineering", "role": "Seat Subteam Leader", "blurb": "Here to start my second major in Mechanical Engineering alongside some of the best instructors I'll probably ever have"}, {"name": "Manjot Singh Hanspal", "year": "U3", "department": "Mechanical Engineering", "role": "Pedals Subteam Leader", "blurb": "After those excruciating days of practicing PDEs, when I'm just about to burn my textbooks, I come down to the shop and work on the Baja. Then when I see this this absolute beast of a machine slowly come to life day by day, it makes me say every single ti"}, {"name": "Annabel Jones ", "year": "U2", "department": "Mechanical Engineering", "role": "Brake Subteam Leader", "blurb": "We lose 100% of the competitions we don't attend, so let's get ready "}, {"name": "Kuba Stanczak", "year": "U2", "department": "Materials Engineering", "role": "Composites sub-team co-leader", "blurb": "If I was a car part I'd be the gas tank on account of my explosive personality."}, {"name": "Awais Syed", "year": "U3", "department": "Mechanical Engineering ", "role": "Shifter Subteam leader", "blurb": "Being part of McGill Baja allows you to work with some of the most talented and passionate students in engineering!"}, {"name": "Jimmy Wang", "year": "U4+", "department": "Mech Eng", "role": "Technical Director, Drivetrain Lead, CVT Supervisor", "blurb": "Hello, my name is Jimmy and I am a 5th year Mech Eng student. With 4 years under my belt of Baja activities and knowledgeable in a significant portion of the vehicle, I can support my fellow teammates in developing their sub-systems. Providing guidance to"}, {"name": "Kazi Shafin Ahmed", "year": "U3", "department": "Mechanical Engineering", "role": "CVT Cooling Subteam Leader", "blurb": "Getting my hands dirty while gaining fun engineering experience and building connections with an amazing group of passionate and talented people? Could not ask for any better!"}, {"name": "Sherif Azmy", "year": "U3", "department": "Mechanical Engineering", "role": "Gas Tank sub-team leader", "blurb": "Trying my hardest to not make the car go boom-boom"}, {"name": "Maria", "year": "U3", "department": "Mech", "role": "Framed", "blurb": "Hello! I was told writing a bio could be useful for the future if ever a future employer wants to look me up on the team, so this is me writing a bio, now please hire me future employer!\n\nPossible things of interest to future employers: The most expensive"}, {"name": "Tiffany Butler", "year": "U4+", "department": "Civil Engineering", "role": "Miscellaneous Parts Sub-team Leader", "blurb": "My goal this year is to design and build a utility cart for the racing vehicles to use at competitions. I’ve grown up riding off-roading vehicles, but it wasn’t until this year that I was able to work on the design & build side of things. Excited to get s"}, {"name": "Anjali Jindal", "year": "U2", "department": "Mechanical Engineering", "role": "Miscellaneous Subteam Leader", "blurb": "I look forward to learning as much as possible this year from all the amazing people that make up McGill Baja! Being able to see and apply what you're learning in class to practical applications is a huge part makes Baja so special and exciting. \nOh, and "}, {"name": "Sylvain Pagnier", "year": "U3", "department": "Mechanical Engineering", "role": "Electronics Subteam Lead", "blurb": "I don't even like cars but the Baja team is so fun and rewarding that it doesn't even matter"}, {"name": "Josh", "year": "U2", "department": "Mech eng", "role": "", "blurb": "Hey I’m josh, I’m the best josh on this team, whooo go josh!"}, {"name": "Stephane Bergeron", "year": "U4+", "department": "Mechanical Engineering ", "role": "Quick Fix Demon", "blurb": "Big year for the team. Time to bring back some silverware "}, {"name": "Andrei Radu", "year": "U4+", "department": "Mechanical", "role": "Front Drivetrain Subteam Leader", "blurb": "Probably sleep deprived "}, {"name": "Yuli(Alex) He", "year": "U2", "department": "Mathematics", "role": "Seat Subteam leader", "blurb": ""}, {"name": "Gabriel Lauer ", "year": "U3", "department": "Chemical Engineering ", "role": "Sub Team Leader Misc. ", "blurb": "Is this Chem-E-Car? "}, {"name": "Joshua Wheeler", "year": "U2", "department": "Mechanical Engineering", "role": "Suspension Subteam Co-Leader", "blurb": "Who ever knew dynamically attaching wheels to a frame could be this fun"}]}
